---
kind: property
id: P:Autodesk.Revit.DB.MEPCurve.LevelOffset
source: html/de6ae69a-d462-80c9-58e0-ea5bac2a1447.htm
---
# Autodesk.Revit.DB.MEPCurve.LevelOffset Property

The offset of the MEP curve.

## Syntax (C#)
```csharp
public double LevelOffset { get; set; }
```

## Remarks
This property is used to retrieve the offset of the MEP curve.
If the curve is not in a horizontal plane, this value will be the start point's offset.